Revit 2027 API
FaceDetailNode.LineProperties Property
 Access to the line (pen) properties of the curve being drawn.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LineProperties LineProperties { get; }
Public ReadOnly Property LineProperties As LineProperties
	Get
public:
property LineProperties^ LineProperties {
	LineProperties^ get ();
}
member LineProperties : LineProperties with get
Property Value
LineProperties
See Also
Reference
FaceDetailNode Class
Autodesk.Revit.DB Namespace